In [ ]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [ ]:
conn = sqlite3.connect("/content/Db-IMDB-Assignment.db")

In [ ]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()
print(tables)

['Movie', 'Genre', 'Language', 'Country', 'Location', 'M_Location', 'M_Country', 'M_Language', 'M_Genre', 'Person', 'M_Producer', 'M_Director', 'M_Cast']

In [ ]:
%load_ext sql
%sql sqlite:///Db-IMDB-Assignment.db

'Connected: @Db-IMDB-Assignment.db'

In [ ]:
%%time
%%sql

UPDATE Movie SET year = REPLACE(year, "I", "");
UPDATE Movie SET year = REPLACE(year, "V", "");
UPDATE Movie SET year = REPLACE(year, "X ", "");
UPDATE Movie SET title = LTRIM(title);
UPDATE Movie SET year = RTRIM(LTRIM(year));
UPDATE Movie SET rating = RTRIM(LTRIM(rating));
UPDATE Movie SET num_votes = RTRIM(LTRIM(num_votes));
UPDATE M_Producer SET pid = RTRIM(LTRIM(pid));
UPDATE M_Producer SET mid = RTRIM(LTRIM(mid));
UPDATE M_Director SET pid = RTRIM(LTRIM(pid));
UPDATE M_Director SET mid = RTRIM(LTRIM(mid));
UPDATE M_Cast SET pid = RTRIM(LTRIM(pid));
UPDATE M_Cast SET mid = RTRIM(LTRIM(mid));
UPDATE M_Genre SET gid = RTRIM(LTRIM(gid));
UPDATE M_Genre SET mid = RTRIM(LTRIM(mid));
UPDATE Genre SET gid = RTRIM(LTRIM(gid));
UPDATE Genre SET name = RTRIM(LTRIM(name));
UPDATE Person SET name = RTRIM(LTRIM(name));
UPDATE Person SET pid = RTRIM(LTRIM(pid));
UPDATE Person SET gender = RTRIM(LTRIM(gender));

 * sqlite:///Db-IMDB-Assignment.db
3473 rows affected.
3473 rows affected.
3473 rows affected.
3473 rows affected.
3473 rows affected.
3473 rows affected.
3473 rows affected.
11749 rows affected.
11749 rows affected.
3473 rows affected.
3473 rows affected.
82835 rows affected.
82835 rows affected.
3473 rows affected.
3473 rows affected.
328 rows affected.
328 rows affected.
37566 rows affected.
37566 rows affected.
37566 rows affected.
CPU times: user 208 ms, sys: 81.4 ms, total: 289 ms
Wall time: 574 ms

[]

Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedyâ€™ and year is a leap year) Your query should return director name, the movie name, and the year.

In [ ]:
#%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = """ SELECT persontable.Name AS 'Person_Name_Director', movie_Table.title AS 'Movie Title Name', movie_Table."year" AS 'Movie Year_Wise' FROM Person persontable 
JOIN M_Director moviedirec_Table ON moviedirec_Table.PID = persontable.PID  
JOIN Movie movie_Table ON movie_Table.MID = moviedirec_Table.MID  
JOIN M_Genre moviegen_Table ON moviegen_Table.MID = movie_Table.MID 
JOIN Genre gen_Table ON gen_Table.GID = moviegen_Table.GID  
WHERE gen_Table.Name LIKE '%Com%' AND (movie_Table."year" % 4 == 0 OR movie_Table."year" % 100 != 0 AND movie_Table."year" % 400 == 0)"""
grader_1(query1)

  Person_Name_Director                   Movie Title Name Movie Year_Wise
0         Milap Zaveri                         Mastizaade            2016
1         Danny Leiner  Harold & Kumar Go to White Castle            2004
2       Anurag Kashyap                 Gangs of Wasseypur            2012
3         Frank Coraci        Around the World in 80 Days            2004
4        Griffin Dunne             The Accidental Husband            2008
5          Anurag Basu                             Barfi!            2012
6      Gurinder Chadha                  Bride & Prejudice            2004
7           Mike Judge    Beavis and Butt-Head Do America            1996
8     Tarun Mansukhani                            Dostana            2008
9         Shakun Batra                      Kapoor & Sons            2016

Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [ ]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """ select persontable.Name from Person persontable join M_Cast mov_Cast_table on persontable.PID=TRIM(mov_Cast_table.PID) join Movie movie_Table on movie_Table.MID=mov_Cast_table.MID where movie_Table.title='Anand' and movie_Table."year"=1971 """
grader_2(query2)

               Name
0  Amitabh Bachchan
1     Rajesh Khanna
2    Brahm Bhardwaj
3        Ramesh Deo
4         Seema Deo
5        Dev Kishan
6       Durga Khote
7     Lalita Kumari
8      Lalita Pawar
9      Atam Prakash
CPU times: user 155 ms, sys: 1.51 ms, total: 156 ms
Wall time: 157 ms

Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [ ]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))


query_less_1970 ="""SELECT TRIM(persontable.PID) FROM Person persontable JOIN M_Cast mov_Cast_table ON persontable.PID = TRIM(mov_Cast_table.PID) JOIN Movie movie_Table ON TRIM(movie_Table.MID) = TRIM(mov_Cast_table.MID) WHERE CAST(SUBSTR(movie_Table."year",-4) AS INTEGER) < 1970"""
query_more_1990="""SELECT TRIM(persontable.PID) FROM Person persontable JOIN M_Cast mov_Cast_table ON persontable.PID = TRIM(mov_Cast_table.PID) JOIN Movie movie_Table ON TRIM(movie_Table.MID) = TRIM(mov_Cast_table.MID) WHERE CAST(SUBSTR(movie_Table."year",-4) AS INTEGER) > 1990""" 


print(grader_3a(query_less_1970, query_more_1990))

(4942, 1)
(62570, 1)
True
CPU times: user 39.1 s, sys: 3.32 s, total: 42.4 s
Wall time: 42.4 s

In [ ]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    assert (q3_results.shape == (300,1))

query3 = """WITH CAST_ON_1970 AS (SELECT TRIM(persontable.PID) FROM Person persontable JOIN M_Cast mov_Cast_table ON persontable.PID = TRIM(mov_Cast_table.PID) JOIN Movie movie_Table ON movie_Table.MID = mov_Cast_table.MID WHERE movie_Table."year" < 1970), CAST_ON_1990 AS (SELECT TRIM(persontable.PID) FROM Person persontable JOIN M_Cast mov_Cast_table ON persontable.PID = TRIM(mov_Cast_table.PID) JOIN Movie movie_Table ON movie_Table.MID = mov_Cast_table.MID WHERE movie_Table."year" > 1990) SELECT persontable.Name AS 'Name of actor' FROM Person persontable WHERE TRIM(PID) IN CAST_ON_1970 AND TRIM(persontable.PID) IN CAST_ON_1990"""
print(grader_3(query3))

      Name of actor
0      Rishi Kapoor
1  Amitabh Bachchan
2            Asrani
3      Zohra Sehgal
4   Parikshat Sahni
5     Rakesh Sharma
6       Sanjay Dutt
7         Ric Young
8             Yusuf
9    Suhasini Mulay
None
CPU times: user 403 ms, sys: 13.4 ms, total: 417 ms
Wall time: 417 ms

Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [ ]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    #print(query_4a.count)
    print(query_4a.head(10)) 
    return (query_4a.shape == (1462,2))


query_4a ="""select distinct movi_dir.PID as Person_ID,count(*) as count_of_movies from M_Director movi_dir group by movi_dir.PID order by count_of_movies desc"""

print(grader_4a(query_4a))

   Person_ID  count_of_movies
0  nm0223522               39
1  nm0080315               35
2  nm0698184               30
3  nm0890060               30
4  nm0080333               29
5  nm0611531               27
6  nm0007181               21
7  nm0154113               19
8  nm0759662               19
9  nm0007131               18
True
CPU times: user 11.6 ms, sys: 1.98 ms, total: 13.6 ms
Wall time: 13.6 ms

In [ ]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    return (query_4a.shape == (58,2))


query_4a="""select distinct person_table.Name PersonDirector,Count(*) Movie_Count from Person person_table join M_Director direct_name on person_table.PID=direct_name.PID group by direct_name.PID having count(*)>=10 order by Movie_Count desc"""
print(grader_4a(query_4a))

         PersonDirector  Movie_Count
0          David Dhawan           39
1          Mahesh Bhatt           35
2          Priyadarshan           30
3       Ram Gopal Varma           30
4          Vikram Bhatt           29
5  Hrishikesh Mukherjee           27
6           Yash Chopra           21
7       Basu Chatterjee           19
8        Shakti Samanta           19
9          Subhash Ghai           18
True
CPU times: user 29.6 ms, sys: 832 Âµs, total: 30.5 ms
Wall time: 33.3 ms

Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [ ]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))

query5a = """ select movie_Table.year as Year_Values, count(*) as Number_of_Movies from Movie movie_Table join(select distinct mid from M_Cast where mid not in(select mov_Cast_table.mid from M_Cast mov_Cast_table join Person person_table on person_table.pid = trim(mov_Cast_table.pid) where person_table.gender = 'Male'))subqueryname on subqueryname.mid = movie_Table.mid group by movie_Table.year """
grader_5a(query5a)

  Year_Values  Number_of_Movies
0        1939                 1
1        1999                 1
2        2000                 1
3        2018                 1
CPU times: user 315 ms, sys: 0 ns, total: 315 ms
Wall time: 440 ms

Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [ ]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """ WITH  nfmk AS (SELECT TRIM(mov_Cast_table.MID) FROM M_Cast mov_Cast_table INNER JOIN Person person_table ON person_table.PID = TRIM(mov_Cast_table.PID) WHERE person_table.Gender in ('Male', NULL) GROUP BY mov_Cast_table.MID), numberfemalemov AS (SELECT movie_Table.MID FROM Movie movie_Table INNER JOIN M_Cast mov_Cast_table ON TRIM(mov_Cast_table.MID) = movie_Table.MID WHERE TRIM(movie_Table.MID) NOT IN nfmk AND mov_Cast_table.PID NOTNULL GROUP BY movie_Table.MID), ayr AS (SELECT movie_Table."year", COUNT(*) AS 'tnm' FROM Movie as movie_Table GROUP BY movie_Table."year") SELECT movie_Table."year" as YearWise, COUNT(movie_Table."year") AS Number_of_movies_by_female, COUNT(movie_Table."year") * 100 / a.tnm AS '% age of movies by female' FROM Movie movie_Table INNER JOIN numberfemalemov nfm ON nfm.MID = movie_Table.MID INNER JOIN ayr a ON movie_Table."year" = a."year" GROUP BY movie_Table."year" ORDER BY movie_Table."year" """
grader_5b(query5b)

  YearWise  Number_of_movies_by_female  % age of movies by female
0     1939                           1                         50
1     1999                           1                          1
2     2000                           1                          1
3     2018                           1                          0
CPU times: user 231 ms, sys: 2.29 ms, total: 233 ms
Wall time: 236 ms

Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [ ]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6="""select movie_Table.title 'Title of Movie',count(distinct(mov_Cast_table.PID)) Size_of_the_Cast from movie movie_Table join M_Cast mov_Cast_table on mov_Cast_table.MID=movie_Table.MID group by movie_Table.MID order by Size_of_the_Cast"""                            
grader_6(query6)

                                    Title of Movie  Size_of_the_Cast
0                                       Kala Jigar                 1
1                                Return of Hanuman                 1
2                                      Subah Subah                 1
3  Chaar Sahibzaade 2: Rise of Banda Singh Bahadur                 1
4                            Vaibhav Sethia: Don't                 1
5                                Raja Aur Rangeeli                 2
6                                           Anjaam                 2
7                                         Ram Raaj                 2
8                              Mumbai Delhi Mumbai                 2
9                                 Chaar Sahibzaade                 2
CPU times: user 174 ms, sys: 20.5 ms, total: 194 ms
Wall time: 194 ms

Q7 --- A decade is a sequence of 10 consecutive years.
For example, say in your database you have movie information starting from 1931.
the first decade is 1931, 1932, ..., 1940,
the second decade is 1932, 1933, ..., 1941 and so on.
Find the decade D with the largest number of films and the total number of films in D

In [ ]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(180))
    assert (q7a_results.shape == (78, 2))

query7a = """select CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER) as yearwise,count(MID) cou_mov from movie group by CAST(SUBSTR(TRIM(movie.year),-4) AS yearwise)"""
grader_7a(query7a)

    yearwise  cou_mov
0       1931        1
1       1936        3
2       1939        2
3       1941        1
4       1943        1
..       ...      ...
73      2014      126
74      2015      119
75      2016      129
76      2017      126
77      2018      104

[78 rows x 2 columns]
CPU times: user 8.76 ms, sys: 0 ns, total: 8.76 ms
Wall time: 8.72 ms

In [ ]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(713))
    assert (q7b_results.shape == (713, 4)) 

query7b="""select queryone.year,queryone.countone,querytwo.year,querytwo.counttwo from (select year,count(MID) countone from movie group by year)queryone join (select year,count(MID) counttwo from movie group by year)querytwo on querytwo.year<=queryone.year+9 and querytwo.year>=queryone.year"""
grader_7b(query7b)

     year  countone  year  counttwo
0    1931         1  1931         1
1    1931         1  1936         3
2    1931         1  1939         2
3    1936         3  1936         3
4    1936         3  1939         2
..    ...       ...   ...       ...
708  2016       129  2017       126
709  2016       129  2018       104
710  2017       126  2017       126
711  2017       126  2018       104
712  2018       104  2018       104

[713 rows x 4 columns]
CPU times: user 13.4 ms, sys: 0 ns, total: 13.4 ms
Wall time: 14.5 ms

In [ ]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """ WITH nonduplicateyearcolumn AS ( SELECT DISTINCT CAST(SUBSTR(year,-4) AS UNSIGNED) tsfdays, CAST(SUBSTR(year,-4) AS UNSIGNED) yearwisestarting, CAST(SUBSTR(year,-4) AS UNSIGNED)+9 yearwiseending, '10 Year : ' || SUBSTR(year,-4)   yearwiseten FROM Movie), nomovyear AS ( SELECT COUNT(DISTINCT MID) nom, CAST(SUBSTR(year,-4) AS UNSIGNED) tsfdays FROM Movie GROUP BY CAST(SUBSTR(year,-4) AS UNSIGNED)), nmid AS  (SELECT SUM(nom) sum_of_mov, drec.yearwiseten FROM nomovyear noyer, nonduplicateyearcolumn drec WHERE noyer.tsfdays BETWEEN drec.yearwisestarting AND drec.yearwiseending GROUP BY drec.yearwiseten ) SELECT yearwiseten, sum_of_mov FROM nmid WHERE sum_of_mov = (SELECT MAX(sum_of_mov) FROM nmid)"""
grader_7(query7)

      yearwiseten  sum_of_mov
0  10 Year : 2008        1203
CPU times: user 25.6 ms, sys: 0 ns, total: 25.6 ms
Wall time: 35.2 ms

Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [ ]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    assert (q8a_results.shape == (73408, 3))

query8a = """ select mov_Cast_table.PID Cast_id,mov_dir_table.PID Director_id,count(mov_dir_table.MID) number_of_movies from M_cast mov_Cast_table join M_Director mov_dir_table on mov_Cast_table.MID = mov_dir_table.MID group by mov_Cast_table.PID,mov_dir_table.PID"""
grader_8a(query8a)

     Cast_id Director_id  number_of_movies
0  nm0000002   nm0496746                 1
1  nm0000027   nm0000180                 1
2  nm0000039   nm0896533                 1
3  nm0000042   nm0896533                 1
4  nm0000047   nm0004292                 1
5  nm0000073   nm0485943                 1
6  nm0000076   nm0000229                 1
7  nm0000092   nm0178997                 1
8  nm0000093   nm0000269                 1
9  nm0000096   nm0113819                 1
CPU times: user 249 ms, sys: 19.9 ms, total: 269 ms
Wall time: 270 ms

In [ ]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """WITH yaschopra AS (SELECT PID FROM Person WHERE Name like "%Yash Chopra%"), noams AS(SELECT TRIM(mov_Cast_table.PID) actid,TRIM(mvid.PID) dprsni, COUNT(DISTINCT TRIM(mvid.MID)) AS nom FROM M_Cast mov_Cast_table, M_Director mvid WHERE TRIM(mov_Cast_table.MID)= TRIM(mvid.MID) GROUP BY actid, dprsni),nor AS( SELECT actid,dprsni,MAX(nom) Count FROM noams numofmovs,yaschopra ychop WHERE numofmovs.dprsni <> ychop.PID GROUP BY actid ), noy AS  (SELECT actid,dprsni,numofmovs.nom COUNT FROM noams numofmovs, yaschopra ychop WHERE numofmovs.dprsni = ychop.PID),fqury AS (SELECT aone.actid,aone.COUNT numberMov FROM  noy aone LEFT OUTER JOIN nor atw ON aone.actid=atw.actid WHERE  aone.COUNT>=IFNULL(atw.COUNT,0) ORDER BY aone.COUNT DESC)SELECT prsn.Name Name_of_person,fiqry.numberMov 'Number_of_Persons' FROM  Person prsn, fqury fiqry WHERE prsn.PID = fiqry.actid"""
grader_8(query8)

     Name_of_person  Number_of_Persons
0       Jagdish Raj                 11
1  Manmohan Krishna                 10
2          Iftekhar                  9
3     Shashi Kapoor                  7
4     Rakhee Gulzar                  5
5    Waheeda Rehman                  5
6          Ravikant                  4
7    Achala Sachdev                  4
8       Neetu Singh                  4
9     Leela Chitnis                  3
(245, 2)
CPU times: user 1min 33s, sys: 134 ms, total: 1min 33s
Wall time: 1min 33s

Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [ ]:
%%time
def grader_9(q9a):
    q9_results  = pd.read_sql_query(q9a,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (2382, 1))

query9 = """select distinct PID AS spersonid from M_Cast mcasttable where MID in (select MID from M_Cast mcasttable where PID LIKE '%nm0451321%')and PID NOT LIKE '%nm0451321%'"""
grader_9(query9)

   spersonid
0  nm0004418
1  nm1995953
2  nm2778261
3  nm0631373
4  nm0241935
5  nm0792116
6  nm1300111
7  nm0196375
8  nm1464837
9  nm2868019
(2382, 1)
CPU times: user 40.6 ms, sys: 3 ms, total: 43.6 ms
Wall time: 45.6 ms

In [ ]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9=""" select prsnthre.name from person prsnthre where trim(prsnthre.pid) in (select distinct trim(cthre.pid) from m_cast cthre where trim(cthre.mid) in (select trim(movtwo.mid) from movie movtwo where trim(movtwo.mid) in (select trim(ctwo.mid) from m_cast ctwo where trim(ctwo.pid) in (select trim(pid) from person prsnone where trim(pid) in (select trim(castetable.pid) from m_cast castetable where trim(castetable.mid) in (select trim(movtable.mid) from movie movtable where trim(movtable.mid) in (select trim(mcastable.mid) from m_cast mcastable where trim(mcastable.pid) in (select trim(prsn.pid) from person prsn where trim(prsn.name) like '%shah rukh khan%'))))))) except select trim(pid) from person castetable where trim(pid) in (select trim(castetable.pid) from m_cast castetable where trim(castetable.mid) in (select trim(movtable.mid) from movie movtable where trim(movtable.mid) in (select trim(mcastable.mid) from m_cast mcastable where trim(mcastable.pid) in (select trim(prsn.pid) from person prsn where trim(prsn.name) like '%shah rukh khan%')))))"""
grader_9(query9)

                    Name
0           Freida Pinto
1            Rohan Chand
2           Damian Young
3        Waris Ahluwalia
4  Caroline Christl Long
5          Rajeev Pahuja
6      Michelle Santiago
7        Alicia Vikander
8           Dominic West
9         Walton Goggins
(25698, 1)
CPU times: user 504 ms, sys: 22.2 ms, total: 526 ms
Wall time: 684 ms